# ViewerAnnotationCropActive Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerAnnotationCropActive Property
ParameterTypeId Class See Also
---
"Annotation Crop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerAnnotationCropActive { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerAnnotationCropActive As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerAnnotationCropActive {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace